global.prefa = ['!', '.', ',', '🐤', '🗿'];
global.namaown = "𝙳𝙴𝙼𝙾𝙽 𝙺𝙸𝙽𝙶";
global.namabot = "𝙳𝙴𝙼𝙾𝙽";
global.versisc = "𝟔.𝟎";
global.autoReply = true;
global.owner = ["2347041039367"];
global.tele = "https://wa.me/2347041039367";
global.url = 'https://whatsapp.com/channel/0029Vah3fKtCnA7oMPTPJm1h';
global.namastore = "DEMON HOSTING";
global.antibug = true;
global.simbol = '*么*';
global.wlcm = [];
global.wlcmm = [];
global.limitawal = {
  'premium': "Infinity",
  'free': 0x14
};
/* MarxKing is always kings*/
global.mess = {
  'success': "𝗬𝗼𝘂𝗿 𝗱𝗲𝗲𝗱 𝗶𝘀 𝗱𝗼𝗻𝗲... 𝗳𝗼𝗿 𝗻𝗼𝘄.",
  'admin': "`[ # ]` 𝗧𝗵𝗶𝘀 𝗰𝗼𝗺𝗺𝗮𝗻𝗱 𝗶𝘀 𝗼𝗻𝗹𝘆 𝗳𝗼𝗿 𝗴𝗿𝗼𝘂𝗽 𝗮𝗱𝗺𝗶𝗻𝘀... 𝗯𝗲𝘄𝗮𝗿𝗲.",
  'botAdmin': "`[ # ]` 𝗜 𝗻𝗲𝗲𝗱 𝗰𝗼𝗻𝘁𝗿𝗼𝗹 𝗵𝗲𝗿𝗲. 𝗠𝗮𝗸𝗲 𝗺𝗲 𝗮𝗻 𝗮𝗱𝗺𝗶𝗻.",
  'OnlyOwner': "`[ # ]` 𝗢𝗻𝗹𝘆 𝘁𝗵𝗲 𝗺𝗮𝘀𝘁𝗲𝗿 𝗰𝗮𝗻 𝗱𝗼 𝘁𝗵𝗶𝘀.",
  'OnlyGrup': "`[ # ]` 𝗧𝗵𝗶𝘀 𝗶𝘀 𝗳𝗼𝗿 𝗴𝗿𝗼𝘂𝗽𝘀... 𝗮𝗻𝗱 𝘁𝗵𝗲 𝗴𝗮𝗺𝗲 𝗶𝘀 𝗷𝘂𝘀𝘁 𝗯𝗲𝗴𝗶𝗻𝗻𝗶𝗻𝗴.",
  'private': "`[ # ]` 𝗧𝗵𝗶𝘀 𝗶𝘀 𝗼𝗻𝗹𝘆 𝗳𝗼𝗿 𝗽𝗿𝗶𝘃𝗮𝘁𝗲 𝗰𝗵𝗮𝘁𝘀... 𝘁𝗿𝘂𝘀𝘁 𝗺𝗲, 𝗶𝘁'𝘀 𝗯𝗲𝘁𝘁𝗲𝗿 𝗶𝗻 𝗵𝗲𝗿𝗲.",
  'wait': "`[ # ]` 𝗪𝗮𝗶𝘁... 𝘆𝗼𝘂𝗿 𝘁𝗶𝗺𝗲 𝗶𝘀 𝗰𝗼𝗺𝗶𝗻𝗴.",
  'notregist': "`[ # ]` 𝗬𝗼𝘂 𝗮𝗿𝗲𝗻'𝘁 𝗶𝗻 𝗺𝘆 𝗹𝗶𝘁𝘁𝗹𝗲 𝗹𝗶𝘀𝘁 𝘆𝗲𝘁. 𝗥𝗲𝗴𝗶𝘀𝘁𝗲𝗿... 𝗮𝗻𝗱 𝘄𝗲'𝗹𝗹 𝗵𝗮𝘃𝗲 𝘀𝗼𝗺𝗲 𝗳𝘂𝗻.",
  'premium': "`[ # ]` 𝗢𝗻𝗹𝘆 𝗳𝗼𝗿 𝘁𝗵𝗲 𝗽𝗿𝗲𝗺𝗶𝘂𝗺 𝗼𝗻𝗲𝘀... 𝘄𝗮𝗻𝗻𝗮 𝗷𝗼𝗶𝗻? 𝗖𝗵𝗮𝘁 𝘁𝗵𝗲 𝗺𝗮𝘀𝘁𝗲𝗿.",
  'endLimit': "`[ # ]` 𝗬𝗼𝘂'𝘃𝗲 𝗿𝗲𝗮𝗰𝗵𝗲𝗱 𝘆𝗼𝘂𝗿 𝗹𝗶𝗺𝗶𝘁 𝗳𝗼𝗿 𝘁𝗼𝗱𝗮𝘆. 𝗪𝗲'𝗹𝗹 𝘀𝘁𝗮𝗿𝘁 𝗮𝗴𝗮𝗶𝗻 𝗮𝘁 𝗺𝗶𝗱𝗻𝗶𝗴𝗵𝘁.",
  'bugrespon': "`[ # ]` 𝗪𝗮𝗶𝘁 𝗮 𝗺𝗼𝗺𝗲𝗻𝘁... 𝗬𝗼𝘂'𝗿𝗲 𝗻𝗲𝘅𝘁 𝗶𝗻 𝗹𝗶𝗻𝗲.",
  'donebug': "`[ # ]` 𝗧𝗵𝗲 𝗯𝘂𝗴 𝗵𝗮𝘀 𝗯𝗲𝗲𝗻 𝘀𝗲𝗻𝘁... 𝗻𝗼 𝗼𝗻𝗲'𝘀 𝘀𝗮𝗳𝗲 𝗻𝗼𝘄."
};
let fs = require('fs');
let file = require.resolve(__filename);
fs.watchFile(file, () => {
  fs.unwatchFile(file);
  console.log("Update " + __filename);
  delete require.cache[file];
  require(file);
});